#Generated by ResourceBundle Editor (http://eclipse-rbe.sourceforge.net)

######################################################################################
#    ARCHIVOS DE MENSAJES DE LA LÓGICA DE NEGOCIO Y DATOS	 #
######################################################################################
######################################################################################
AUTHENTICATION_ERROR = Error de autenticaci\u00F3n, usuario o contrase\u00F1a no corresponden.

AUTHENTICATION_OK = Autenticaci\u00F3n exitosa.

AUTORIZACION_CORRECTAMENTE = La autorizaci\u00F3n se realiz\u00F3 correctamente.

BLOCK_ACCOUNT = Cuenta de usuario bloqueada.

CHANGE_PASSWORD_REQUIRED = Error en autenticaci\u00F3n, requiere cambio de contrase\u00F1a.

CHANGE_ROLE_ERROR = Ha ocurrido un error al actualizar el rol\: 

CHANGE_ROLE_OK = Los roles se han actualizado al usuario satisfactoriamente.

CREATE_ACCOUNT = La cuenta de usuario se ha creado satisfactoriamente:

CURRENT_PASSWD_ERROR = La contrase\u00F1a actual indicada no corresponde.

DESAUTORIZACION_CORRECTAMENTE = La desautorizaci\u00F3n se realiz\u00F3 correctamente.

EMAIL_DUPLICATE = Ya existe un usuario con este correo.

EMAIL_INVALIDO = El correo electr\u00F3nico es inv\u00E1lido.

EMAIL_NO_SEND = No fu\u00E9 posible enviar el correo, consulte con el administrador.

EMAIL_SEND = Se envi\u00F3 el correo satisfactoriamente

GETBASICDATA_ERROR = No fue posibe recuperar informacion del usuario.

GETBASICDATA_OK = Se obtienen los datos basicos satisfactoriamente.

INACTIVE_ACCOUNT = La cuenta de usuario se encuentra inactiva.

PASSWD_CHANGED_ERROR = Hubo un error en el cambio de contrase\u00F1a.

PASSWD_CHANGED_LIMITED = La contrase\u00F1a debe ser diferente a las \u00FAltimas cuatro registradas.

PASSWD_CHANGED_OK = El cambio de contrase\u00F1a se realiz\u00F3 correctamente.

PKI_VALIDATE_ERROR = Error de validacion de la firma digital.

RELATION_CREATE = La relaci\u00E9n ya fu\u00E9 creada, Intente con otro usuario.

REMEMBERPASSWORD_ERROR = No fue posible enviar el correo.

REMEMBERPASSWORD_OK = Se envio al correo el recordatorio de la contrase\u00F1a.

REMEMBERPASSWORD_USERNOTFOUND = No fue posible enviar el correo. Usuario no encontrado en el sistema.

ROLE_ASSOCIATE = El usuario ya tiene asociado el rol\: 

ROLE_NOT_FOUND = El dominio no contiene el rol\: 

ROLE_NOT_FOUND_FOR_DOMAIN = No existen roles asociados al dominio\: 

TRANSACTION_ERROR = No fue posible realizar la Transacci\u00F3n, Consulte con el administrador.

TRANSACTION_OK = La Transacci\u00F3n se realiz\u00F3 satisfactoriamente.

USER_AUTORIZADO = El usuario actualmente se encuentra autorizado para el prestador seleccionado.

USER_DUPLICATE = Ya existe un login para el usuario con identificaci\u00F3n\: 

USER_FOUND = Ya existe un usuario con el mismo login.

USER_MODIFY = Se actualiz\u00F3 correctamente el usuario.

USER_NOT_FOUND = En el repositorio externo no se encuentra registado el usuario con la identificaci\u00F3n\: 

USER_NOT_FOUND_GENERAL = Usuario o contrase\u00F1a invalidos.

USER_NO_REG_LDAP = El usuario no se encuentra registrado como externo en LDAP.

USER_REGISTERED = Usuario registrado con exito.

USER_REGISTERED_LDAP = El usuario ya se encuentra registrado.

VALIDATION_ERROR = Error en validaci\u00F3n.

VALIDATION_OK = Validaci\u00F3n Correcta de campos\: 

administrador = Administrador

creadoPor = Creado Por

delegado = Delegado

msgInvalidCredential = Usuario o clave invalidos.\n

msgValidacionPassword = La contrase\u00F1a debe tener un tama\u00F1o m\u00EDnimo de 8 caracteres, m\u00EDnimo un car\u00E1cter alfab\u00E9tico en may\u00FAscula, uno en min\u00FAscula y uno num\u00E9rico, no se puede usar la cuenta de usuario como contrase\u00F1a o como parte de ella y debe ser diferente a las \u00FAltimas cuatro registradas.\n

USER_EXISTS_TIPO_DOC = Ya existe un usuario registrado con mismo tipo y n\u00FAmero de documento  

